references/broad-analysis.org
#+SETUPFILE: ../reports/exports/theme-readtheorg.setup
* Problem description
What do I want to achieve with this tool ? 
** Definitions
*** What is the Target Data ?
I want to have access to the key data that make a job or a carreer path interesting. Here is a non-exhaustive list.
**** is it easy to access ?
***** is it new ?
***** what formation is required ?
***** what is the entrance cost ?
***** what success stories ?
**** demand > supply
**** loan
**** re-usability
***** tremplin
***** multiple use case
**** connection with your parcours
*** What problem sould this tool solve ? 
what is it you want to solve / answer ?
**** can there be a tool to help me find a job / seek for opportunities ?
***** can this be quicker the reading / regular digging ?
What this tool could/should  bring :
****** have an overview of field to dig further in
****** needs to be quick to browse : efficient summary
****** needs to be reliable : data quality / second check
** Objectives
*** Needs
**** need to find a job quickly
**** need to be able to have a market overview
**** need to be able to propose a data product
***** for my portfolio
***** as an open source webapp
*** Will
**** want to have alerts for job opportunities
**** want to reveal career paths / market trends
**** want to keep track of my interests to have suggestions of paths
*** Use
**** [#A] target opportunities
***** sheets of wanted words
***** query matching algorithms
**** [#A] data exploration
**** [#B] cluster
***** nlp
**** [#B] find jobs I didn't know about
**** get warned if new opportunities
**** use it as a model for finding my perfect match in the world / exploring the economy
**** make it open source and useable by anyone
*** Features
**** Update
**** Clustering
**** Visualization
* Approches
There are two approches to keep in mind.
** stathead / qualitative
use available data, stats and probability
** scout / quantitative
Get humanly involved in the question to avoid using data science where it is not needed and to know where it can be of cruitial help. Helps keeping DS work pertinent.
* Project management
How do I overcome :
** Time constraints
*** run test / small steps / prototypes
** Limits
what is shaky about this approach ?
*** quantitative unknown
**** former predictions / insights : find and evaluate
**** trending/ubiquitous ideas/concepts
*** is it useful ?
**** what would be the user case ?
***** for individuals : orientation
***** for firms : market analysis
*** data acquisition is costly
**** if the approach is not efficient : pb
**** TODO can only be tested if large amount of data
**** need to gain faith / enthusiasm
***** take small step achievements
****** small jobs market
****** data science / computing
***** select exciting data sources
***** readings
****** signal and the noise
****** use cases
****** data culture / world
***** methods / milstones
****** doubt is good
****** TODO testing is good
** Crossovers
*** test features / ideas
to gain confidence / go in the right direction
**** UI / UX
***** possible on small amounts of data
***** test on real users (friends, colleages)
**** broader analysis
***** only possible on larger amount
**** application to other fields ?
**** sponsoring ?
*** build prototype project to show
* Plan
** Blogging
*** Org babel
*** Website
** Courses
*** Databases
*** Visualization
*** Machine learning
*** NLP
*** Hash tables / numpy computation
*** Proba / stats
** Jobs seeker
** Implementation
*** Start a clean project
**** TODO git
***** a branch per functionality
**** TODO projectile
**** file system
***** /
****** org
****** scraper
****** database
****** explorer
**** database
***** sql ?
***** csv ?
**** org babel file / emacs env
***** snippets
C-c & ...
Tables
C-c C-t is snippet mode for test
***** TODO track time
:LOGBOOK:
CLOCK: [2018-08-21 mar. 13:59]--[2018-08-21 mar. 14:08] =>  0:09
:END:
***** track habits
:LOGBOOK:
CLOCK: [2018-08-21 mar. 14:14]--[2018-08-21 mar. 15:29] =>  1:15
:END:
***** decide what goes public and what does not at expension
