references/broad-analysis.tex
% Created 2018-10-05 ven. 17:39
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{teddd}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={teddd},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Problem description}
\label{sec:org9c94ad2}
What do I want to achieve with this tool ? 
\subsection{Definitions}
\label{sec:orgd8d2454}
\subsubsection{What is the Target Data ?}
\label{sec:org84d6b0f}
I want to have access to the key data that make a job or a carreer path interesting. Here is a non-exhaustive list.
\begin{enumerate}
\item is it easy to access ?
\label{sec:orgf31c87a}
\begin{enumerate}
\item is it new ?
\label{sec:orgc917c96}
\item what formation is required ?
\label{sec:org33f91cd}
\item what is the entrance cost ?
\label{sec:orga3a94bd}
\item what success stories ?
\label{sec:org53e1a5f}
\end{enumerate}
\item demand > supply
\label{sec:org2fa6a66}
\item loan
\label{sec:orga83b524}
\item re-usability
\label{sec:orgf03b375}
\begin{enumerate}
\item tremplin
\label{sec:org7354487}
\item multiple use case
\label{sec:orga4d0c8c}
\end{enumerate}
\item connection with your parcours
\label{sec:org5aa779d}
\end{enumerate}
\subsubsection{What problem sould this tool solve ?}
\label{sec:org209357d}
what is it you want to solve / answer ?
\begin{enumerate}
\item can there be a tool to help me find a job / seek for opportunities ?
\label{sec:org643ba84}
\begin{enumerate}
\item can this be quicker the reading / regular digging ?
\label{sec:org41a90b4}
What this tool could/should  bring :
\begin{enumerate}
\item have an overview of field to dig further in
\label{sec:org6cf9a0a}
\item needs to be quick to browse : efficient summary
\label{sec:orgb00dd9a}
\item needs to be reliable : data quality / second check
\label{sec:org04aa0df}
\end{enumerate}
\end{enumerate}
\end{enumerate}
\subsection{Objectives}
\label{sec:org521e7b3}
\subsubsection{Needs}
\label{sec:orgce21eae}
\begin{enumerate}
\item need to find a job quickly
\label{sec:orgf481347}
\item need to be able to have a market overview
\label{sec:org62b6c56}
\item need to be able to propose a data product
\label{sec:org3763e4c}
\begin{enumerate}
\item for my portfolio
\label{sec:org8a352bd}
\item as an open source webapp
\label{sec:orgf0e3981}
\end{enumerate}
\end{enumerate}
\subsubsection{Will}
\label{sec:org60efc5b}
\begin{enumerate}
\item want to have alerts for job opportunities
\label{sec:orgd59f9e8}
\item want to reveal career paths / market trends
\label{sec:org713dd60}
\item want to keep track of my interests to have suggestions of paths
\label{sec:org1e253b5}
\end{enumerate}
\subsubsection{Use}
\label{sec:org36b6a30}
\begin{enumerate}
\item target opportunities
\label{sec:orga72ebed}
\begin{enumerate}
\item sheets of wanted words
\label{sec:orgc22ffa4}
\item query matching algorithms
\label{sec:org212049c}
\end{enumerate}
\item data exploration
\label{sec:orgf2837db}
\item cluster
\label{sec:orgd1664b4}
\begin{enumerate}
\item nlp
\label{sec:orgd9386eb}
\end{enumerate}
\item find jobs I didn't know about
\label{sec:org33e2dfe}
\item get warned if new opportunities
\label{sec:orgdc85682}
\item use it as a model for finding my perfect match in the world / exploring the economy
\label{sec:orgbc2521f}
\item make it open source and useable by anyone
\label{sec:orgd404bfa}
\end{enumerate}
\subsubsection{Features}
\label{sec:org24cc0e5}
\begin{enumerate}
\item Update
\label{sec:orgaf354bb}
\item Clustering
\label{sec:orgdae5145}
\item Visualization
\label{sec:orgd9dd2a4}
\end{enumerate}
\section{Approches}
\label{sec:org6f6e7b2}
There are two approches to keep in mind.
\subsection{stathead / qualitative}
\label{sec:org7ed8580}
use available data, stats and probability
\subsection{scout / quantitative}
\label{sec:org159eb68}
Get humanly involved in the question to avoid using data science where it is not needed and to know where it can be of cruitial help. Helps keeping DS work pertinent.
\section{Project management}
\label{sec:orgf989d49}
How do I overcome :
\subsection{Time constraints}
\label{sec:org2fddd20}
\subsubsection{run test / small steps / prototypes}
\label{sec:orga033b4b}
\subsection{Limits}
\label{sec:orgf8fa20f}
what is shaky about this approach ?
\subsubsection{quantitative unknown}
\label{sec:org5fde9bc}
\begin{enumerate}
\item former predictions / insights : find and evaluate
\label{sec:orga0882df}
\item trending/ubiquitous ideas/concepts
\label{sec:org083e223}
\end{enumerate}
\subsubsection{is it useful ?}
\label{sec:org486e809}
\begin{enumerate}
\item what would be the user case ?
\label{sec:org97abe9c}
\begin{enumerate}
\item for individuals : orientation
\label{sec:org1f37c4b}
\item for firms : market analysis
\label{sec:org2e026ee}
\end{enumerate}
\end{enumerate}
\subsubsection{data acquisition is costly}
\label{sec:orgefc294a}
\begin{enumerate}
\item if the approach is not efficient : pb
\label{sec:orgf839fb9}
\item {\bfseries\sffamily TODO} can only be tested if large amount of data
\label{sec:orgbcf450d}
\item need to gain faith / enthusiasm
\label{sec:org16cc9f2}
\begin{enumerate}
\item take small step achievements
\label{sec:org3f958b6}
\begin{enumerate}
\item small jobs market
\label{sec:org71640e5}
\item data science / computing
\label{sec:org8d2578f}
\end{enumerate}
\item select exciting data sources
\label{sec:org76991f5}
\item readings
\label{sec:org5f4eb94}
\begin{enumerate}
\item signal and the noise
\label{sec:orgdf1a87e}
\item use cases
\label{sec:orge2f92f9}
\item data culture / world
\label{sec:org8fe9af3}
\end{enumerate}
\item methods / milstones
\label{sec:org987ab53}
\begin{enumerate}
\item doubt is good
\label{sec:org87aac99}
\item {\bfseries\sffamily TODO} testing is good
\label{sec:org636735c}
\end{enumerate}
\end{enumerate}
\end{enumerate}
\subsection{Crossovers}
\label{sec:org6ae0673}
\subsubsection{test features / ideas}
\label{sec:org98c9144}
to gain confidence / go in the right direction
\begin{enumerate}
\item UI / UX
\label{sec:orgafcf678}
\begin{enumerate}
\item possible on small amounts of data
\label{sec:orgbefee6c}
\item test on real users (friends, colleages)
\label{sec:org1d8790d}
\end{enumerate}
\item broader analysis
\label{sec:org1759ddb}
\begin{enumerate}
\item only possible on larger amount
\label{sec:org355391b}
\end{enumerate}
\item application to other fields ?
\label{sec:org5e4e033}
\item sponsoring ?
\label{sec:org783b116}
\end{enumerate}
\subsubsection{build prototype project to show}
\label{sec:orgd7a821e}
\section{Plan}
\label{sec:org684eab8}
\subsection{Blogging}
\label{sec:org9e877f0}
\subsubsection{Org babel}
\label{sec:org7939331}
\subsubsection{Website}
\label{sec:org527c63c}
\subsection{Courses}
\label{sec:orga92db54}
\subsubsection{Databases}
\label{sec:org166498a}
\subsubsection{Visualization}
\label{sec:org43c0b10}
\subsubsection{Machine learning}
\label{sec:orgefc3432}
\subsubsection{NLP}
\label{sec:org922ff11}
\subsubsection{Hash tables / numpy computation}
\label{sec:org3afe8b7}
\subsubsection{Proba / stats}
\label{sec:org6ca7150}
\subsection{Jobs seeker}
\label{sec:orgb340d7e}
\subsection{Implementation}
\label{sec:org1a010a2}
\subsubsection{Start a clean project}
\label{sec:org26186da}
\begin{enumerate}
\item {\bfseries\sffamily TODO} git
\label{sec:org7e05ae5}
\begin{enumerate}
\item a branch per functionality
\label{sec:org26d61b5}
\end{enumerate}
\item {\bfseries\sffamily TODO} projectile
\label{sec:org7777ba1}
\item file system
\label{sec:orgdf3cf62}
\begin{enumerate}
\item /
\label{sec:org46ba94a}
\begin{enumerate}
\item org
\label{sec:org701c64b}
\item scraper
\label{sec:orgdd20c79}
\item database
\label{sec:org1bf1306}
\item explorer
\label{sec:org8c5e92b}
\end{enumerate}
\end{enumerate}
\item database
\label{sec:orgae2c9be}
\begin{enumerate}
\item sql ?
\label{sec:org1db0e29}
\item csv ?
\label{sec:orgcf75aee}
\end{enumerate}
\item org babel file / emacs env
\label{sec:org1b2bcb1}
\begin{enumerate}
\item snippets
\label{sec:orgda7c92b}
C-c \& \ldots{}
Tables
C-c C-t is snippet mode for test
\item {\bfseries\sffamily TODO} track time
\label{sec:org1dd1470}
\item track habits
\label{sec:org632ce02}
\item decide what goes public and what does not at expension
\label{sec:orgb0263e9}
\end{enumerate}
\end{enumerate}
\end{document}
